{
  "Books": [
    {
      "id": "001",
      "author": "Chinua Achebe",
      "country": "Nigeria",
      "imageLink": "https://upload.wikimedia.org/wikipedia/en/6/65/ThingsFallApart.jpg",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/Things_Fall_Apart",
      "pages": 209,
      "title": "Things Fall Apart",
      "year": 1958,
      "description": "Things Fall Apart is a 1958 novel by Nigerian author Chinua Achebe. It is Achebe's debut novel and was written when he was working at the Nigerian Broadcasting Corporation. The novel was first published in London by Heinemann on 17 June 1958.\n\nThe story, which is set in British Nigeria, centers on Okonkwo, a traditional influential leader of the fictional Igbo clan, Umuofia, who opposes colonialism and early Christianity. The novel's title was taken from a verse of \"The Second Coming\", a 1919 poem by Irish poet W. B. Yeats. Things Fall Apart was considered Achebe's magnum opus and formed his \"African trilogy\" with his other novels; No Longer at Ease and Arrow of God. The novel explores many themes, especially culture, masculinity, and colonialism. "
    },
    {
      "id": "002",
      "author": "Jane Austen",
      "country": "United Kingdom",
      "imageLink": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/PrideAndPrejudiceTitlePage.jpg/800px-PrideAndPrejudiceTitlePage.jpg",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/Pride_and_Prejudice",
      "pages": 279,
      "title": "Pride and Prejudice",
      "year": 1813,
      "description": "Pride and Prejudice is the second novel by English author Jane Austen, published in 1813. A novel of manners, it follows the character development of Elizabeth Bennet, the protagonist of the book, who learns about the repercussions of hasty judgments and comes to appreciate the difference between superficial goodness and actual goodness.\n\nMr Bennet, owner of the Longbourn estate in Hertfordshire, has five daughters, but his property is entailed and can only be passed to a male heir. His wife lacks an inheritance, so his family faces becoming poor upon his death. Thus, it is imperative that at least one of the daughters marry well to support the others, which is a primary motivation driving the plot."
    },
    {
      "id": "003",
      "author": "Fyodor Dostoevsky",
      "country": "Russia",
      "imageLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1537559393i/23398716.jpg",
      "language": "Russian",
      "link": "https://en.wikipedia.org/wiki/Crime_and_Punishment",
      "pages": 430,
      "title": "Crime and Punishment",
      "year": 1866,
      "description": "Crime and Punishment is a novel by the Russian author Fyodor Dostoevsky. It was first published in the literary journal The Russian Messenger in twelve monthly installments during 1866. It was later published in a single volume. It is the second of Dostoevsky's full-length novels following his return from ten years of exile in Siberia. Crime and Punishment is considered the first great novel of his mature period of writing and is often cited as one of the greatest works of world literature."
    },
    {
      "id": "004",
      "author": "Gabriel García Márquez",
      "country": "Colombia",
      "imageLink": "https://m.media-amazon.com/images/I/91GoCrV6emL.jpg",
      "language": "Spanish",
      "link": "https://en.wikipedia.org/wiki/One_Hundred_Years_of_Solitude",
      "pages": 417,
      "title": "One Hundred Years of Solitude",
      "year": 1967,
      "description": "One Hundred Years of Solitude is a 1967 novel by Colombian author Gabriel García Márquez that tells the multi-generational story of the Buendía family, whose patriarch, José Arcadio Buendía, founded the fictitious town of Macondo. The novel is often cited as one of the supreme achievements in world literature. It was recognized as one of the most important works of the Spanish language during the 4th International Conference of the Spanish Language held in Cartagena de Indias in March 2007.\n\nThe magical realist style and thematic substance of the book established it as an important representative novel of the literary Latin American Boom of the 1960s and 1970s, which was stylistically influenced by Modernism (European and North American) and the Cuban Vanguardia (Avant-Garde) literary movement."
    },
    {
      "id": "005",
      "author": "Haruki Murakami",
      "country": "Japan",
      "imageLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1616843770i/17308035.jpg",
      "language": "Japanese",
      "link": "https://en.wikipedia.org/wiki/Norwegian_Wood_(novel)",
      "pages": 296,
      "title": "Norwegian Wood",
      "year": 1987,
      "description": "Norwegian Wood (ノルウェイの森, Noruwei no Mori) is a 1987 novel by Japanese author Haruki Murakami. The novel is a nostalgic story of loss. It is told from the first-person perspective of Toru Watanabe, who looks back on his days as a college student living in Tokyo. Through Watanabe's reminiscences, readers see him develop relationships with two very different women—the beautiful yet emotionally troubled Naoko, and the outgoing, lively Midori.\n\nThis novel is set in late-1960s Tokyo during a period when Japanese students, like those of many other nations, were protesting against the established order. While it serves as the backdrop against which the events of the novel unfold, Murakami (through the eyes of Watanabe and Midori) portrays the student movement as largely weak-willed and hypocritical. "
    },
    {
      "id": "006",
      "author": "Homer",
      "country": "Greece",
      "imageLink": "https://cdn2.penguin.com.au/covers/400/9780241735657.jpg",
      "language": "Greek",
      "link": "https://en.wikipedia.org/wiki/The_Odyssey",
      "pages": 541,
      "title": "The Odyssey",
      "year": -800,
      "description": "The Odyssey is one of two major epic poems of ancient Greek literature attributed to Homer. It is one of the oldest surviving works of literature and remains popular with modern audiences. Like the Iliad, the Odyssey is divided into 24 books. It follows the heroic king of Ithaca, Odysseus, also known by the Latin variant Ulysses, and his homecoming journey after the ten-year long Trojan War. His journey from Troy to Ithaca lasts an additional ten years, during which time he encounters many perils and all of his crewmates are killed. In Odysseus's long absence, he is presumed dead, leaving his wife Penelope and son Telemachus to contend with a group of unruly suitors competing for Penelope's hand in marriage. "
    },
    {
      "id": "007",
      "author": "Leo Tolstoy",
      "country": "Russia",
      "imageLink": "https://cdn.kobo.com/book-images/3ac03eac-d437-47e3-9b15-52542edabd56/1200/1200/False/war-and-peace-34.jpg",
      "language": "Russian",
      "link": "https://en.wikipedia.org/wiki/War_and_Peace",
      "pages": 1225,
      "title": "War and Peace",
      "year": 1869,
      "description": "War and Peace is a literary work by the Russian author Leo Tolstoy. Set during the Napoleonic Wars, the work comprises both a fictional narrative and chapters in which Tolstoy discusses history and philosophy. An early version was published serially beginning in 1865, after which the entire book was rewritten and published in 1869. It is regarded, with Anna Karenina, as Tolstoy's finest literary achievement, and it remains an internationally praised classic of world literature."
    },
    {
      "id": "008",
      "author": "George Orwell",
      "country": "United Kingdom",
      "imageLink": "https://anylang.net/sites/default/files/covers/1984.jpg",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/Nineteen_Eighty-Four",
      "pages": 328,
      "title": "1984",
      "year": 1949,
      "description": "Nineteen Eighty-Four (also published as 1984) is a dystopian novel and cautionary tale by English writer George Orwell. It was published on 8 June 1949 by Secker & Warburg as Orwell's ninth and final completed book. Thematically, it centres on the consequences of totalitarianism, mass surveillance, and repressive regimentation of people and behaviours within society. Orwell, a staunch believer in democratic socialism and member of the anti-Stalinist Left, modelled Britain under authoritarian socialism in the novel on the Soviet Union in the era of Stalinism and on the very similar practices of both censorship and propaganda in Nazi Germany. More broadly, the novel examines the role of truth and facts within societies and the ways in which they can be manipulated. "
    },
    {
      "id": "009",
      "author": "Franz Kafka",
      "country": "Austria-Hungary",
      "imageLink": "https://m.media-amazon.com/images/I/4128Qqa0HcL._UF1000,1000_QL80_.jpg",
      "language": "German",
      "link": "https://en.wikipedia.org/wiki/The_Trial",
      "pages": 255,
      "title": "The Trial",
      "year": 1925,
      "description": "The Trial (German: Der Prozess) is a novel written by Franz Kafka in 1914 and 1915 and published posthumously on 26 April 1925. One of his best-known works, it tells the story of Josef K., a man arrested and prosecuted by a remote, inaccessible authority, with the nature of his crime revealed neither to him nor to the reader. Heavily influenced by Dostoevsky's Crime and Punishment and The Brothers Karamazov, Kafka even went so far as to call Dostoevsky a blood relative. Like Kafka's two other novels, The Castle and Amerika, The Trial was never completed, although it does include a chapter that appears to bring the story to an intentionally abrupt ending. "
    },
    {
      "id": "010",
      "author": "Albert Camus",
      "country": "France",
      "imageLink": "https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781681771359/the-stranger-9781681771359_hr.jpg",
      "language": "French",
      "link": "https://en.wikipedia.org/wiki/The_Stranger_(Camus_novel)",
      "pages": 123,
      "title": "The Stranger",
      "year": 1942,
      "description": "The Stranger also published in English as The Outsider, is a 1942 novella written by French author Albert Camus. The first of Camus's novels to be published, the story follows Meursault, an indifferent settler in French Algeria, who, weeks after his mother's funeral, kills an unnamed Arab man in Algiers. The story is divided into two parts, presenting Meursault's first-person narrative before and after the killing. "
    },
    {
      "id": "011",
      "author": "Herman Melville",
      "country": "United States",
      "imageLink": "https://www.pagepublications.co/cdn/shop/files/9781648337031_1_c1b6fba0-fc90-4583-8900-88f0d35c6641.png?v=1714398965",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/Moby-Dick",
      "pages": 635,
      "title": "Moby-Dick",
      "year": 1851,
      "description": "Moby-Dick; or, The Whale is an 1851 epic novel by American writer Herman Melville. The book is centered on the sailor Ishmael's narrative of the maniacal quest of Ahab, captain of the whaling ship Pequod, for vengeance against Moby Dick, the giant white sperm whale that bit off his leg on the ship's previous voyage. A contribution to the literature of the American Renaissance, Moby-Dick was published to mixed reviews, was a commercial failure, and was out of print at the time of the author's death in 1891. Its reputation as a Great American Novel was established only in the 20th century, after the 1919 centennial of its author's birth. William Faulkner said he wished he had written the book himself, and D. H. Lawrence called it \"one of the strangest and most wonderful books in the world\" and \"the greatest book of the sea ever written\". Its opening sentence, \"Call me Ishmael\", is among world literature's most famous. "
    },
    {
      "id": "012",
      "author": "Virginia Woolf",
      "country": "United Kingdom",
      "imageLink": "https://m.media-amazon.com/images/I/710voErwQ3L._UF1000,1000_QL80_.jpg",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/To_the_Lighthouse",
      "pages": 209,
      "title": "To the Lighthouse",
      "year": 1927,
      "description": "To the Lighthouse is a 1927 novel by Virginia Woolf. The novel centres on the Ramsay family and their visits to the Isle of Skye in Scotland between 1910 and 1920. "
    },
    {
      "id": "013",
      "author": "H.G. Wells",
      "country": "United Kingdom",
      "imageLink": "https://almabooks.com/wp-content/uploads/2016/10/9781847496270.jpg",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/The_Time_Machine",
      "pages": 118,
      "title": "The Time Machine",
      "year": 1895,
      "description": "The Time Machine is an 1895 dystopian post-apocalyptic science fiction novella by H. G. Wells about a Victorian scientist known as the Time Traveller who travels to the year 802,701. The work is generally credited with the popularization of the concept of time travel by using a vehicle or device to travel purposely and selectively forward or backward through time. The term \"time machine\", coined by Wells, is now almost universally used to refer to such a vehicle or device. "
    },
    {
      "id": "014",
      "author": "Mary Shelley",
      "country": "United Kingdom",
      "imageLink": "https://d3525k1ryd2155.cloudfront.net/f/244/532/9780451532244.RH.0.x.jpg",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/Frankenstein",
      "pages": 280,
      "title": "Frankenstein",
      "year": 1818,
      "description": "Frankenstein; or, The Modern Prometheus is an 1818 Gothic novel written by English author Mary Shelley. Frankenstein tells the story of Victor Frankenstein, a young scientist who creates a sapient creature in an unorthodox scientific experiment that involved putting it together with different body parts. Shelley started writing the story when she was 18 and staying in Bath, and the first edition was published anonymously in London on 1 January 1818, when she was 20. Her name first appeared in the second edition, which was published in Paris in 1821. "
    },
    {
      "id": "015",
      "author": "Jorge Luis Borges",
      "country": "Argentina",
      "imageLink": "https://images1.penguinrandomhouse.com/cover/9780679422990",
      "language": "Spanish",
      "link": "https://en.wikipedia.org/wiki/Ficciones",
      "pages": 224,
      "title": "Ficciones",
      "year": 1944,
      "description": "Ficciones (in English: \"Fictions\") is a collection of short stories by Argentine writer and poet Jorge Luis Borges, originally written and published in Spanish between 1941 and 1956. Thirteen stories from Ficciones were first published by New Directions in the English-language anthology Labyrinths (1962). In the same year, Grove Press published the entirety of the book in English using the same title as in the original language. \"The Approach to Al-Mu'tasim\" originally appeared published in A History of Eternity (Historia de la eternidad) (1936). Ficciones became Borges's most famous book and made him known worldwide.\n\nThe book is dedicated to writer Esther Zemborain de Torres Duggan, a friend and collaborator of Borges's. "
    },
    {
      "id": "016",
      "author": "Mark Twain",
      "country": "United States",
      "imageLink": "https://cloud.firebrandtech.com/api/v2/image/111/9780785839903/CoverArtHigh/XL",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/Adventures_of_Huckleberry_Finn",
      "pages": 366,
      "title": "Adventures of Huckleberry Finn",
      "year": 1884,
      "description": "Adventures of Huckleberry Finn is a picaresque novel by American author Mark Twain that was first published in the United Kingdom in December 1884 and in the United States in February 1885.\n\nCommonly named among the Great American Novels, the work is among the first in major American literature to be written throughout in vernacular English, characterized by local color regionalism. It is told in the first person by Huckleberry \"Huck\" Finn, the narrator of two other Twain novels (Tom Sawyer Abroad and Tom Sawyer, Detective) and a friend of Tom Sawyer. It is a direct sequel to The Adventures of Tom Sawyer. "
    },
    {
      "id": "017",
      "author": "Miguel de Cervantes",
      "country": "Spain",
      "imageLink": "https://bookshelfthomasville.com/cdn/shop/files/DONQUIXOTE.jpg?v=1730905419",
      "language": "Spanish",
      "link": "https://en.wikipedia.org/wiki/Don_Quixote",
      "pages": 1072,
      "title": "Don Quixote",
      "year": 1605,
      "description": "Don Quixote, the full title being The Ingenious Gentleman Don Quixote of La Mancha, is a Spanish novel by Miguel de Cervantes. The novel, originally published in two parts, in 1605 and 1615 is considered a founding work of Western literature. It's often said to be the first modern novel. The novel has been labelled by many well-known authors as the \"best novel of all time\" and the \"best and most central work in world literature\". Don Quixote is also one of the most-translated books in the world and one of the best-selling novels of all time. "
    },
    {
      "id": "018",
      "author": "Emily Brontë",
      "country": "United Kingdom",
      "imageLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1478641029i/32929156.jpg",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/Wuthering_Heights",
      "pages": 416,
      "title": "Wuthering Heights",
      "year": 1847,
      "description": "Wuthering Heights is the only novel by the English author Emily Brontë, initially published in 1847 under her pen name \"Ellis Bell\". It concerns two families of the landed gentry living on the West Yorkshire moors, the Earnshaws and the Lintons, and their turbulent relationships with the Earnshaws' foster son, Heathcliff. The novel, influenced by Romanticism and Gothic fiction, is considered a classic of English literature.\n\nWuthering Heights was accepted by publisher Thomas Newby along with Anne Brontë's Agnes Grey before the success of their sister Charlotte Brontë's novel Jane Eyre, but they were published later. The first American edition was published in April 1848 by Harper & Brothers of New York. After Emily's death, Charlotte edited a second edition of Wuthering Heights, which was published in 1850. "
    },
    {
      "id": "019",
      "author": "J.D. Salinger",
      "country": "United States",
      "imageLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1398034300i/5107.jpg",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/The_Catcher_in_the_Rye",
      "pages": 234,
      "title": "The Catcher in the Rye",
      "year": 1951,
      "description": "The Catcher in the Rye is the only novel by American author J. D. Salinger. It was partially published in serial form in 1945–46 before being novelized in 1951. Originally intended for adults, it is often read by adolescents for its themes of angst and alienation, and as a critique of superficiality in society. The novel also deals with themes of innocence, identity, belonging, loss, connection, sex, and depression. The main character, Holden Caulfield, has become an icon for teenage rebellion. Caulfield, nearly of age, gives his opinion on a wide variety of topics as he narrates his recent life events. "
    },
    {
      "id": "020",
      "author": "Ernest Hemingway",
      "country": "United States",
      "imageLink": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxTUDl5EvhKK5MQ-6rGld7050IV9P6BznB4w&s",
      "language": "English",
      "link": "https://en.wikipedia.org/wiki/The_Old_Man_and_the_Sea",
      "pages": 127,
      "title": "The Old Man and the Sea",
      "year": 1952,
      "description": "The Old Man and the Sea is a 1952 novella by the American author Ernest Hemingway. Written between December 1950 and February 1951, it was the last major fictional work Hemingway published during his lifetime. It tells the story of Santiago, an aging fisherman, and his long struggle to catch a giant marlin. The novella was highly anticipated and was released to record sales; the initial critical reception was equally positive, but attitudes have varied significantly since then. "
    }
  ]
}
